"""
    Домашнее задание для 6 урока.
    Реализация консольного файлового менеджера
"""


def print_header():
    print("Выберите пункт меню:")
    print("1  - Создать папку")
    print("2  - Удалить файл/папку")
    print("3  - Копировать файл/папку")
    print("4  - Просмотр содержимого рабочей директории")
    print("5  - Просмотреть только папки")
    print("6  - Просмотреть только файлы")
    print("7  - Просмотр информации об операционной системе")
    print("8  - Создатель программы")
    print("9  - Играть в викторину")
    print("10 - Мой банковский счет")
    print("11 - Смена рабочей директории")
    print("12 - Выход")
    return input("Выберите пункт меню :")

#def console_file_manager():

print_header()








